Autodesk.Revit.Creation.FamilyItemFactory.NewCurveByPoints(Autodesk.Revit.DB.ReferencePointArray)
Create a 3d curve through two or more points in an Autodesk
Revit family document.
Returns: The newly created curve.
points: Two or more PointElements. The curve will interpolate
these points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when points is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when points does not contain at least two PointElements.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family is not a Conceptual Mass Family.

Autodesk.Revit.Creation.FamilyItemFactory.NewReferencePoint(Autodesk.Revit.DB.PointElementReference)
Create a reference point on an existing reference in an Autodesk
Revit family document.
Returns: The newly created ReferencePoint.
Remarks: The location and coordinate system of the point is
determined by the particular PointReference subclass, and
the point will remain constrained to that
reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family is not a Conceptual Mass Family.

Autodesk.Revit.Creation.FamilyItemFactory.NewReferencePoint(Autodesk.Revit.DB.Transform)
Create a reference point at a given location and with a given
coordinate system in an Autodesk Revit family document.
Returns: The newly created ReferencePoint.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family is not a Conceptual Mass Family.

Autodesk.Revit.Creation.FamilyItemFactory.NewReferencePoint(Autodesk.Revit.DB.XYZ)
Creates a reference point.
Create a reference point at a given location in an Autodesk
Revit family document.
Returns: The newly created ReferencePoint.
Remarks: The ReferencePoint will have a default coordinate system
corresponding to the global coordinate system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family is not a Conceptual Mass Family.

Autodesk.Revit.Creation.FamilyItemFactory.NewSymbolicCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.SketchPlane)
Create a symbolic curve in an Autodesk Revit family document.
Returns: The newly created symbolic curve.
curve: The geometry curve of the newly created symbolic curve.
sketchPlane: The sketch plane for the symbolic curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.
Thrown when symbolic curve creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewControl(Autodesk.Revit.DB.ControlShape,Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ)
Add a new control into the Autodesk Revit family document.
Returns: If successful, the newly created control is returned, otherwise an
exception with error information will be thrown.
controlShape:  The shape of the control.
view:  The view in which the control is to be visible. It
must be a FloorPlan view or a CeilingPlan view.
origin:  The origin of the control.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"view" or "position"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"view"-is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"controlType"-is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when control creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewModelText(System.String,Autodesk.Revit.DB.ModelTextType,Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.HorizontalAlign,System.Double)
Create a model text in the Autodesk Revit family document.
Returns: If successful, the newly created model text is returned, otherwise an
exception with error information will be thrown.
text: The text to be displayed.
modelTextType:
The type of model text. If this parameter is null, the default type will be used.
sketchPlane:
The sketch plane of the model text. The direction of model text is determined by the normal of the sketch plane.
To extrude in the other direction set the depth value to negative.
position: The position of the model text. The position must lie in the sketch plane.
horizontalAlign: The horizontal alignment.
depth: The depth of the model text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument text, sketchPlane or XYZ is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when input argument text is an empty string.
Thrown when input argument horizontalAlign or depth is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when model text creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewOpening(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.CurveArray)
Create an opening to cut the wall or ceiling.
Returns: If successful, the newly created opening is returned, otherwise an
exception with error information will be thrown.
host: Host elements that new opening would lie in. The host can only be a wall or a ceiling.
profile: The profile of the newly created opening. This may contain more
than one curve loop. Each loop must be a fully closed curve loop and the loops may not
intersect. The profiles will be projected into the host plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument host or profile is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when host isn't a wall or a ceiling.
Thrown when profile doesn't contain any loops.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when opening creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewRadialDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.DimensionType)
Generate a new radial dimension object using a specified dimension type.
view:  The view in which the dimension is to be visible.
arcRef:  Geometric reference of the arc to which the dimension is to be bound.
origin:  The point where the witness line of the radial dimension will lie.
dimensionType:  The dimension style to be used for the dimension.
Returns: If creation was successful the new arc length dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks:  The dimension will be created on default place.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument arcRef/dimensionType is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewDiameterDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Creates a new diameter dimension object.
Creates a new diameter dimension object using the default dimension type.
view:  The view in which the dimension is to be visible.
arcRef:  Geometric reference of the arc to which the dimension is to be bound.
origin:  The point where the witness line of the diameter dimension will lie.
Returns: If creation was successful the new diameter dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks:  The currently user set default style is used for the created dimension.
Remarks:  The dimension will be created on default place.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument arcRef is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewRadialDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Creates a new radial dimension object.
Creates a new radial dimension object using the default dimension type.
view:  The view in which the dimension is to be visible.
arcRef:  Geometric reference of the arc to which the dimension is to be bound.
origin:  The point where the witness line of the radial dimension will lie.
Returns: If creation was successful the new arc length dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks:  The currently user set default style is used for the created dimension.
Remarks:  The dimension will be created on default place.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument arcRef is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewArcLengthDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.DimensionType)
Creates a new arc length dimension object using the specified dimension type.
view:  The view in which the dimension is to be visible.
arc:  The extension arc of the dimension.
arcRef:  Geometric reference of the arc to which the dimension is to be bound.
This reference must be parallel to the extension arc.
firstRef:  The first geometric reference to which the dimension is to be bound.
This reference must intersect the arcRef reference.
secondRef:  The second geometric reference to which the dimension is to be bound.
This reference must intersect the arcRef reference.
dimensionType:  The dimension style to be used for the dimension.
Returns: If creation was successful the new arc length dimension is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument arcRef/ref1/ref2/dimensionType is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewArcLengthDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Creates a new arc length dimension object.
Creates a new arc length dimension object using the default dimension type.
view:  The view in which the dimension is to be visible.
arc:  The extension arc of the dimension.
arcRef:  Geometric reference of the arc to which the dimension is to be bound.
This reference must be parallel to the extension arc.
firstRef:  The first geometric reference to which the dimension is to be bound.
This reference must intersect the arcRef reference.
secondRef:  The second geometric reference to which the dimension is to be bound.
This reference must intersect the arcRef reference.
Returns: If creation was successful the new arc length dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks:  The currently user set default style is used for the created dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument arcRef/ref1/ref2 is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewAngularDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.DimensionType)
Creates a new angular dimension object using the specified dimension type.
view:  The view in which the dimension is to be visible.
arc:  The extension arc of the dimension.
firstRef:  The first geometric reference to which the dimension is to be bound.
The reference must be perpendicular to the extension arc.
secondRef:  The second geometric reference to which the dimension is to be bound.
The reference must be perpendicular to the extension arc.
dimensionType:  The dimension style to be used for the dimension.
Returns: If creation was successful the new angular dimension is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument firstRef/secondRef/dimensionType is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewAngularDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Creates a new angular dimension object.
Creates a new angular dimension object using the default dimension type.
view:  The view in which the dimension is to be visible.
arc:  The extension arc of the dimension.
firstRef:  The first geometric reference to which the dimension is to be bound.
The reference must be perpendicular to the extension arc.
secondRef:  The second geometric reference to which the dimension is to be bound.
The reference must be perpendicular to the extension arc.
Returns: If creation was successful the new angular dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks:  The currently user set default style is used for the created dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewLinearDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.DimensionType)
Creates a new linear dimension object using the specified dimension type.
view:  The view in which the dimension is to be visible.
line:  The extension line of the dimension.
references:  An array of geometric references to which the dimension is to be bound.
You must supply at least two references, and all references supplied must be parallel to each other
and perpendicular to the extension line.
dimensionType:  The dimension style to be used for the dimension.
Returns: If creation was successful the new linear dimension is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewLinearDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray)
Creates a new linear dimension object.
Generate a new linear dimension object using the default dimension type.
view:  The view in which the dimension is to be visible.
line:  The extension line of the dimension.
references:  An array of geometric references to which the dimension is to be bound.
You must supply at least two references, and all references supplied must be parallel to each other
and perpendicular to the extension line.
Returns: If creation was successful the new linear dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks:  The currently user set default style is used for the created dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument "references" is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewFormByThickenSingleSurface(System.Boolean,Autodesk.Revit.DB.Form,Autodesk.Revit.DB.XYZ)
Create a new Form element by thickening a single-surface form, and add it into the Autodesk Revit family document.
isSolid: Indicates if the Form is Solid or Void.
singleSurfaceForm: The single-surface form element. It can have one top/bottom face or one side face.
thickenDir: The offset of capped solid.
Returns: This function will modify the input singleSurfaceForm and return the same element.

Autodesk.Revit.Creation.FamilyItemFactory.NewFormByCap(System.Boolean,Autodesk.Revit.DB.ReferenceArray)
Create new Form element by cap operation (to create a single-surface form), and add it into the Autodesk Revit family document.
isSolid: Indicates if the Form is Solid or Void.
profile: The profile of the newly created cap. It should consist of only one curve loop.
Returns: If creation was successful new form is returned.

Autodesk.Revit.Creation.FamilyItemFactory.NewRevolveForms(System.Boolean,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.Reference,System.Double,System.Double)
Create new Form elements by revolve operation, and add them into the Autodesk Revit family document.
isSolid: Indicates if the Form is Solid or Void.
profile: The profile of the newly created revolution. It should consist of only one curve loop.
The profile must be in the same plane as the axis.
axis: The axis of revolution. The axis is a line that must lie in the same plane as the curves in the profile.
startAngle: The start angle of Revolution in radians.
endAngle: The end angle of Revolution in radians.
Returns: If creation was successful new forms are returned.
Remarks: Typically this operation produces only a single form, but some combinations of arguments will create multiple forms from a single profile.

Autodesk.Revit.Creation.FamilyItemFactory.NewSweptBlendForm(System.Boolean,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.ReferenceArrayArray)
Create new Form element by swept blend operation, and add it into the Autodesk Revit family document.
isSolid: Indicates if the Form is Solid or Void.
path: The path of the swept blend. The path should be 2D, where all input curves lie in one plane. If there's more than one profile, the path should be a single curve.
It's required to reference existing geometry.
profiles: The profile set of the newly created swept blend. Each profile should consist of only one curve loop.
Each profile must be in a plane that intersects with the path and is perpendicular to the path at the point of intersection.
Returns: If creation was successful new form is returned.

Autodesk.Revit.Creation.FamilyItemFactory.NewExtrusionForm(System.Boolean,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.XYZ)
Create new Form element by Extrude operation, and add it into the Autodesk Revit family document.
isSolid: Indicates if the Form is Solid or Void.
profile: The profile of extrusion. It should consist of only one curve loop.
direction: The direction of extrusion, with its length the length of the extrusion. The direction must be perpendicular to the plane determined by profile. The length of vector must be non-zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creation is attempted in Conceptual Mass, 2D, or other family where extrusions cannot be created.
Returns: If creation was successful new form is returned.

Autodesk.Revit.Creation.FamilyItemFactory.NewLoftForm(System.Boolean,Autodesk.Revit.DB.ReferenceArrayArray)
Create new Form element by Loft operation, and add it into the Autodesk Revit family document.
isSolid: Indicates if the Form is Solid or Void.
profiles: The profile set of the newly created loft. Each profile should consist of only one curve loop.
Returns: If creation was successful form is are returned.

Autodesk.Revit.Creation.FamilyItemFactory.NewSweptBlend(System.Boolean,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.SweepProfile,Autodesk.Revit.DB.SweepProfile)
Adds a new swept blend into the family document, using a selected reference as the path.
isSolid: Indicates if the swept blend is Solid or Void.
path: The path of the swept blend. The path might be a reference of single curve or edge obtained from existing geometry.
Or the path can be a single sketched curve, and the curve is not required to reference existing geometry.
bottomProfile: The bottom profile of the newly created Swept blend. It should consist of only one curve loop.
the input profile must be in one plane.
topProfile: The top profile of the newly created Swept blend. It should consist of only one curve loop.
The profile must lie in the XY plane, and it will be transformed to the profile plane automatically.
Returns: If creation was successful the new Swept blend is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates a swept blend in a family document. The swept blend will trace from bottom profile
to the top along the path. Revit will determine an appropriate default mapping for the vertices of the
two profiles. If the input profile is to be a cyclic profile (curve or ellipse) it must be split into at
least two segments, so that Revit can find vertices to use for mapping the swept blend.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input arguments-path/bottomProfile/topProfile-are null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-bottomProfile/topProfile-is a curve based profile and the profile
is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-bottomProfile/topProfile-is a curve based profile and the profile
contains null or more than one curve loops.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-bottomProfile/topProfile-is a family symbol based profile and the
family symbol profile is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewSweptBlend(System.Boolean,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.SweepProfile,Autodesk.Revit.DB.SweepProfile)
Adds a new swept blend into the family document.
Add a new swept blend into the family document, using a curve as the path.
isSolid: Indicates if the swept blend is Solid or Void.
path: The path of the swept blend. The path should be a single curve.
Or the path can be a single sketched curve, and the curve is not required to reference existing geometry.
pathPlane:  The sketch plane for the path. Use this when you want to create
a 2D path that resides on an existing planar face. Optional, can be null for a path curve obtained from geometry or
for 2D paths where the path should not reference an existing edge.
bottomProfile: The bottom profile of the newly created Swept blend. It should consist of only one curve loop.
The profile must lie in the XY plane, and it will be transformed to the profile plane automatically.
topProfile: The top profile of the newly created Swept blend. It should consist of only one curve loop.
The profile must lie in the XY plane, and it will be transformed to the profile plane automatically.
Returns: If creation was successful the new Swept blend is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates a swept blend in a family document. The swept blend will trace from bottom profile
to the top along the path. Revit will determine an appropriate default mapping for the vertices of the
two profiles. If the input profile is to be a cyclic profile (curve or ellipse) it must be split into at
least two segments, so that Revit can find vertices to use for mapping the swept blend.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input arguments-path/bottomProfile/topProfile-are null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-bottomProfile/topProfile-is a curve based profile and the profile
is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-bottomProfile/topProfile-is a curve based profile and the profile
contains null or more than one curve loops.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-bottomProfile/topProfile-is a family symbol based profile and the
family symbol profile is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creation is attempted in Conceptual Mass, 2D, or other family where swept blends cannot be created.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewSweep(System.Boolean,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.SweepProfile,System.Int32,Autodesk.Revit.DB.ProfilePlaneLocation)
Adds a new sweep form into the family document, using an array of selected references as a 3D path.
isSolid: Indicates if the Sweep is Solid or Void.
path: The path of the sweep. The path should be reference of curve or edge obtained from existing geometry.
profile: The profile to create the new Sweep. The profile must lie in the XY plane, and it will be
transformed to the profile plane automatically. This may contain more than one curve loop or a profile family.
Each loop must be a fully closed curve loop and the loops must not intersect.
The loop can be a unbound circle or ellipse,  but its geometry will be split in two in
order to satisfy requirements for sketches used in extrusions.
profileLocationCurveIndex: The index of the path curves. The curve upon which the profile
plane will be determined.
profilePlaneLocation: The location on the profileLocationCurve where the profile
plane will be determined.
Returns: If creation was successful the new Sweep is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates a sweep in a family document. The sweep will trace the profile along the path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-path-is null or empty or an unsupported curve type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-profile-is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-profileLocationCurveIndex-is out of index bounds.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-profilePlaneLocation-does not exist in the ProfilePlaneLocation enumeration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewSweep(System.Boolean,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.SweepProfile,System.Int32,Autodesk.Revit.DB.ProfilePlaneLocation)
Adds a new sweep form to the family document.
Adds a new sweep form to the family document, using a path of curve elements.
isSolid: Indicates if the Sweep is Solid or Void.
path: The path of the sweep. The path should be 2D, where all input curves lie in one plane, and the curves are not
required to reference existing geometry.
pathPlane:  The sketch plane for the path. Use this when you want to create
a 2D path that resides on an existing planar face. Optional, can be null for 3D paths or
for 2D paths where the path should not reference an existing face.
profile: The profile of the newly created Sweep. This may contain
more than one curve loop or a profile family. The profile must lie in the XY plane, and it will be
transformed to the profile plane automatically. Each loop must be a fully closed curve loop and the loops
must not intersect.
The loop can be a unbound circle or ellipse,  but its geometry will be split in two in
order to satisfy requirements for sketches used in extrusions.
profileLocationCurveIndex: The index of the path curves. The curve upon which the profile
plane will be determined.
profilePlaneLocation: The location on the profileLocationCurve where the profile
plane will be determined.
Returns: If creation was successful the new Sweep is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates a sweep in a family document. The sweep will trace the profile along the path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-path-is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-profile-is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-profileLocationCurveIndex-is out of index bounds.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-profilePlaneLocation-does not exist in the ProfilePlaneLocation enumeration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creation is attempted in Conceptual Mass, 2D, or other family where sweeps cannot be created.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewRevolution(System.Boolean,Autodesk.Revit.DB.CurveArrArray,Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.Line,System.Double,System.Double)
Add a new Revolution instance into the Autodesk Revit family document.
isSolid: Indicates if the Revolution is Solid or Void.
profile: The profile of the newly created revolution. This may contain
more than one curve loop. Each loop must be a fully closed curve loop and the loops
must not intersect. All loops must lie in the same plane.
The loop can be a unbound circle or ellipse,  but its geometry will be split in two in
order to satisfy requirements for sketches used in extrusions.
sketchPlane: The sketch plane for the revolution.  The direction of revolution
is determined by the normal for the sketch plane.
axis: The axis of revolution. This axis must lie in the same plane as the curve loops.
startAngle: The start angle of Revolution in radians.
endAngle: The end angle of Revolution in radians.
Returns: If creation was successful the new revolution is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates an Revolution in a family document. The Revolution will be
rotated the plane of the Revolution profile about the Axis.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-profile-is null or empty array.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-sketchPlane-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-sketchPlane-is an invalid sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-axis-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creation is attempted in Conceptual Mass, 2D, or other family where revolutions cannot be created.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewBlend(System.Boolean,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.SketchPlane)
Add a new Blend instance into the Autodesk Revit family document.
isSolid: Indicates if the Blend is Solid or Void.
topProfile: The top blend section. It should consist of only one curve loop.
The input profile must be in one plane.
baseProfile: The base blend section. It should consist of only one curve loop.
The input profile must be in one plane.
sketchPlane: The sketch plane for the base profile. Use this to associate the
base of the blend to geometry from another element. Optional, it can be null if you want Revit
to derive a new sketch plane from the geometry of the base profile.
Returns: If creation was successful the new blend is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates a blend in a family document. The blend will be
extended between the two independent pieces of geometry. Revit will determine an appropriate
default mapping for the vertices of the two profiles. The two input profiles must be parallel.
If the input profile is to be a cyclic profile (curve or ellipse) it must be split into at least two
segments, so that Revit can find vertices to use for mapping the blend.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creation is attempted in Conceptual Mass, 2D, or other family where blends cannot be created.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory.NewExtrusion(System.Boolean,Autodesk.Revit.DB.CurveArrArray,Autodesk.Revit.DB.SketchPlane,System.Double)
Add a new Extrusion instance into the Autodesk Revit family document.
isSolid: Indicates if the Extrusion is Solid or Void.
profile: The profile of the newly created Extrusion. This may contain more
than one curve loop. Each loop must be a fully closed curve loop and the loops may not
intersect. All input curves must lie in the same plane.
The loop can be a unbound circle or ellipse,  but its geometry will be split in two in
order to satisfy requirements for sketches used in extrusions.
sketchPlane: The sketch plane for the extrusion.  The direction of extrusion
is determined by the normal for the sketch plane.  To extrude in the other direction set
the end value to negative.
end: The length of the extrusion.
Returns: If creation was successful the new Extrusion is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method creates an extrusion in a family document. The extrusion will be
extended perpendicular to the sketch plane of the extrusion profile.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-profile-is null or empty array.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-sketchPlane-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-sketchPlane-is an invalid sketch plane.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the creation failed.

Autodesk.Revit.Creation.FamilyItemFactory
The Family Item Factory object is used to create new instances of elements within the
Autodesk Revit Family.
Remarks: The Family Item Factory object is a utility object that is used to create new
instances of elements within the Autodesk Revit Family Document. This object should be used to
create elements instead of using New. This
object ensures that the elements created are added to the family document correctly.